#!/bin/bash
. ./pin_on_off.sh
. ./diabox.sh

function camera1 {
if [[ $1 == *"1"* ]]
then
off_on 6 "Проверка ключей камер" "Подключите крайний левый ключ камеры. \n\nСветодиод потух?" "Крайний левый ключ камеры: работает" "Крайний левый ключ камеры: не работает"
fi
}

function camera2 {
if [[ $1 == *"2"* ]]
then
off_on 13 "Проверка ключей камер" "Подключите средний ключ камеры. \n\nСветодиод потух?" "Средний ключ камеры: работает" "Средний ключ камеры: не работает"
fi
}

function camera3 {
if [[ $1 == *"3"* ]]
then
off_on 26 "Проверка ключей камер" "Подключите крайний правый ключ камеры. \n\nСветодиод потух?" "Крайний правый ключ камеры: работает" "Крайний правый ключ камеры: не работает"
fi
}

function cameras {
title=$("Проверка ключей камер")
while :
do
cam_key=$(whiptail --title "Проверка ключей камер" --inputbox "Введите какие из ключей камер есть на плате" 10 60 3>&1 1>&2 2>&3)
exitstatus=$?
if [ $exitstatus = 0 ];
then
	if [[ "$cam_key" == *"2"* ]] || [[ "$cam_key" == *"1"* ]] || [[ "$cam_key" == *"3"* ]];
        then
        camera1 "$cam_key"
        camera2 "$cam_key"
        camera3 "$cam_key"
        break
        else
        mbox "$title" "Вы ввели неправильный номер ключа"
        fi
else
        echo "Отказ от ввода"
fi
done
}

#cameras
